import { expect } from "chai";
import { extractNestedtemplates } from "../parser.js";

describe("ParseNestedTemplate", () => {
  it("should parse nested templates correctly", () => {
    const text = `{{מנהיג
| שם = ג'ון גורטון
| תמונה = [[קובץ:JohnGorton.jpg|250px|מרכז|גורטון, 1967]]
| כיתוב = גורטון בתמונה משנת 1967
| שם בשפת המקור = John Gorton
| שם מלא = ג'ון גריי גורטון
| מדינה = {{דגל|אוסטרליה||+}}
| מקום קבורה =
| תאריך לידה = [[9 בספטמבר]] [[1911]]
| מקום לידה = [[מלבורן]], [[ויקטוריה (אוסטרליה)|ויקטוריה]], [[אוסטרליה]]
| תאריך פטירה = [[19 במאי]] [[2002]]
| מקום פטירה = [[סידני]], [[ניו סאות' ויילס]]
| מפלגה = [[המפלגה הליברלית של אוסטרליה|המפלגה הליברלית]]
| בת זוג = בטינה גורטון (1983-1935) {{ש}} ננסי הורן (2002-1993)
| בן זוג =
| אתר אינטרנט =
| תפקיד1 = {{תפקיד מנהיג
| שם התפקיד = [[ראש ממשלת אוסטרליה]]
| למניין = 19
| התחלת כהונה = [[10 בינואר]] [[1968]]
| סיום כהונה = [[10 במרץ]] [[1971]]
| הקודם בתפקיד = [[ג'ון מק'איוון]]
| הבא בתפקיד = [[ויליאם מקמהון]]
}}
| תפקיד2 = {{תפקיד מנהיג
 |שם התפקיד=שירות צבאי
}}
{{אישיות ביטחונית
| סיווג = חייל
| שם = -
| תמונה = -
| השתייכות = [[קובץ:Air Force Ensign of Australia.svg|22px]] [[חיל האוויר המלכותי האוסטרלי]]
| התחלת פעילות = 1944 
| סיום פעילות = 1940
| דרגה = [[קובץ:RAAF O3 rank.png|18px]] לוטננט טיסה
| תפקידים בשירות = טייס קרב
| פעולות ומבצעים = [[מלחמת העולם השנייה]]
}}
}}`;

    const result = extractNestedtemplates(text, 0);
    expect(result).to.deep.equal([
      {
        name: "מנהיג",
        parameters: {
          שם: `ג'ון גורטון`,
          תמונה: `[[קובץ:JohnGorton.jpg|250px|מרכז|גורטון, 1967]]`,
          כיתוב: `גורטון בתמונה משנת 1967`,
          "שם בשפת המקור": `John Gorton`,
          "שם מלא": `ג'ון גריי גורטון`,
          מדינה: `{{דגל|אוסטרליה||+}}`,
          "מקום קבורה": ``,
          "תאריך לידה": `[[9 בספטמבר]] [[1911]]`,
          "מקום לידה": `[[מלבורן]], [[ויקטוריה (אוסטרליה)|ויקטוריה]], [[אוסטרליה]]`,
          "תאריך פטירה": `[[19 במאי]] [[2002]]`,
          "מקום פטירה": `[[סידני]], [[ניו סאות' ויילס]]`,
          מפלגה: `[[המפלגה הליברלית של אוסטרליה|המפלגה הליברלית]]`,
          "בת זוג": `בטינה גורטון (1983-1935) {{ש}} ננסי הורן (2002-1993)`,
          "בן זוג": ``,
          "אתר אינטרנט": ``,
          תפקיד1: `{{תפקיד מנהיג
| שם התפקיד = [[ראש ממשלת אוסטרליה]]
| למניין = 19
| התחלת כהונה = [[10 בינואר]] [[1968]]
| סיום כהונה = [[10 במרץ]] [[1971]]
| הקודם בתפקיד = [[ג'ון מק'איוון]]
| הבא בתפקיד = [[ויליאם מקמהון]]
}}`,
          תפקיד2: `{{תפקיד מנהיג
 |שם התפקיד=שירות צבאי
}}
{{אישיות ביטחונית
| סיווג = חייל
| שם = -
| תמונה = -
| השתייכות = [[קובץ:Air Force Ensign of Australia.svg|22px]] [[חיל האוויר המלכותי האוסטרלי]]
| התחלת פעילות = 1944 
| סיום פעילות = 1940
| דרגה = [[קובץ:RAAF O3 rank.png|18px]] לוטננט טיסה
| תפקידים בשירות = טייס קרב
| פעולות ומבצעים = [[מלחמת העולם השנייה]]
}}`,
        },
        anonParameters: [],
        fullText: text,
        nested: [
          {
            anonParameters: ["אוסטרליה", "", "+"],
            fullText: "{{דגל|אוסטרליה||+}}",
            name: "דגל",
            nested: [],
            parameters: {},
          },
          {
            name: "ש",
            fullText: "{{ש}}",
            parameters: {},
            anonParameters: [],
            nested: [],
          },
          {
            name: "תפקיד מנהיג",
            anonParameters: [],
            parameters: {
              "שם התפקיד": `[[ראש ממשלת אוסטרליה]]`,
              למניין: `19`,
              "התחלת כהונה": `[[10 בינואר]] [[1968]]`,
              "סיום כהונה": `[[10 במרץ]] [[1971]]`,
              "הקודם בתפקיד": `[[ג'ון מק'איוון]]`,
              "הבא בתפקיד": `[[ויליאם מקמהון]]`,
            },
            fullText: `{{תפקיד מנהיג
| שם התפקיד = [[ראש ממשלת אוסטרליה]]
| למניין = 19
| התחלת כהונה = [[10 בינואר]] [[1968]]
| סיום כהונה = [[10 במרץ]] [[1971]]
| הקודם בתפקיד = [[ג'ון מק'איוון]]
| הבא בתפקיד = [[ויליאם מקמהון]]
}}`,
            nested: [],
          },
          {
            name: "תפקיד מנהיג",
            parameters: {
              "שם התפקיד": `שירות צבאי`,
            },
            anonParameters: [],
            fullText: `{{תפקיד מנהיג
 |שם התפקיד=שירות צבאי
}}`,
            nested: [],
          },
          {
            name: "אישיות ביטחונית",
            nested: [],
            parameters: {
              סיווג: `חייל`,
              שם: `-`,
              תמונה: `-`,
              השתייכות: `[[קובץ:Air Force Ensign of Australia.svg|22px]] [[חיל האוויר המלכותי האוסטרלי]]`,
              "התחלת פעילות": `1944`,
              "סיום פעילות": `1940`,
              דרגה: `[[קובץ:RAAF O3 rank.png|18px]] לוטננט טיסה`,
              "תפקידים בשירות": `טייס קרב`,
              "פעולות ומבצעים": `[[מלחמת העולם השנייה]]`,
            },
            anonParameters: [],
            fullText: `{{אישיות ביטחונית
| סיווג = חייל
| שם = -
| תמונה = -
| השתייכות = [[קובץ:Air Force Ensign of Australia.svg|22px]] [[חיל האוויר המלכותי האוסטרלי]]
| התחלת פעילות = 1944 
| סיום פעילות = 1940
| דרגה = [[קובץ:RAAF O3 rank.png|18px]] לוטננט טיסה
| תפקידים בשירות = טייס קרב
| פעולות ומבצעים = [[מלחמת העולם השנייה]]
}}`,
          },
        ],
      },
      1156,
    ]);
  });
});
