import { expect } from "chai";
import { errorMessages, getTemplates } from "../parser.js";

describe("getTemplates", () => {
  it("should be defined", () => {
    expect(getTemplates).to.be.a("function");
  });

  it("should take two parameters", () => {
    expect(getTemplates.length).to.equal(2);
  });

  it("should return an empty array when an empty string is passed", () => {
    expect(getTemplates("")).to.be.an("array").that.is.empty;
  });

  it("should return an empty array when nothing is passed", () => {
    expect(getTemplates()).to.be.an("array").that.is.empty;
  });

  it("should return an empty array when text without a template is passed", () => {
    const text = "This is a text without template.";
    const result = getTemplates(text);
    expect(result).to.be.an("array").that.is.empty;
  });

  it("extracts a single template with named parameters", () => {
    const wikitext = `
      Some introductory text.
      {{Template1|param1=value1|param2=value2}}
      Some concluding text.
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {
          param1: "value1",
          param2: "value2",
        },
        anonParameters: [],
        fullText: "{{Template1|param1=value1|param2=value2}}",
      },
    ]);
  });

  it("extracts multiple templates with mixed named and anonymous parameters", () => {
    const wikitext = `
      {{Template1|value1|param2=value2|value3}}
      {{Template2|paramA=dataA|dataB}}
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {
          param2: "value2",
        },
        anonParameters: ["value1", "value3"],
        fullText: "{{Template1|value1|param2=value2|value3}}",
      },
      {
        name: "Template2",
        parameters: {
          paramA: "dataA",
        },
        anonParameters: ["dataB"],
        fullText: "{{Template2|paramA=dataA|dataB}}",
      },
    ]);
  });

  it("ignores text outside of templates", () => {
    const wikitext = `
      This is some text outside of templates.
      {{Template1|param1=value1}}
      More text outside.
      {{Template2|paramA=dataA}}
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {
          param1: "value1",
        },
        anonParameters: [],
        fullText: "{{Template1|param1=value1}}",
      },
      {
        name: "Template2",
        parameters: {
          paramA: "dataA",
        },
        anonParameters: [],
        fullText: "{{Template2|paramA=dataA}}",
      },
    ]);
  });

  it("handles templates with no parameters gracefully", () => {
    const wikitext = `
      {{Template1}}
      {{Template2|}}
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {},
        anonParameters: [],
        fullText: "{{Template1}}",
      },
      {
        name: "Template2",
        parameters: {},
        anonParameters: [""],
        fullText: "{{Template2|}}",
      },
    ]);
  });

  it("returns only the template whose name was passed as the second parameter", () => {
    const wikitext = `
      {{Template1|param1=value1}}
      {{Template2|paramA=dataA}}
    `;
    const result = getTemplates(wikitext, { name: "Template1" });
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {
          param1: "value1",
        },
        anonParameters: [],
        fullText: "{{Template1|param1=value1}}",
      },
    ]);
  });

  it("handles two templates with no space between them", () => {
    const wikitext = `
      {{Template1|param1=value1}}{{Template2|paramA=dataA}}
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {
          param1: "value1",
        },
        anonParameters: [],
        fullText: "{{Template1|param1=value1}}",
      },
      {
        name: "Template2",
        parameters: {
          paramA: "dataA",
        },
        anonParameters: [],
        fullText: "{{Template2|paramA=dataA}}",
      },
    ]);
  });

  it("extracts nested templates as part of the parent template when nested is not specified", () => {
    const wikitext = `
      {{OuterTemplate|param1=value1|nested={{InnerTemplate|paramA=dataA}}}}
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "OuterTemplate",
        parameters: {
          param1: "value1",
          nested: "{{InnerTemplate|paramA=dataA}}",
        },
        anonParameters: [],
        fullText:
          "{{OuterTemplate|param1=value1|nested={{InnerTemplate|paramA=dataA}}}}",
      },
    ]);
  });

  it("handles malformed templates gracefully", () => {
    const wikitext = `
      {{Template1|param1=value1
      {{Template2|paramA=dataA}} 
    `;
    expect(() => getTemplates(wikitext)).to.throw(
      errorMessages.unclosedTemplate
    );
  });

  it("handles templates with duplicate named parameters", () => {
    const wikitext = `
      {{Template1|param1=value1|param1=value2}}
    `;
    const result = getTemplates(wikitext);
    expect(result).to.deep.equal([
      {
        name: "Template1",
        parameters: {
          param1: ["value1", "value2"],
        },
        anonParameters: [],
        fullText: "{{Template1|param1=value1|param1=value2}}",
      },
    ]);
  });
  describe("should parse the article correct", () => {
    const articleText = `{{אישיות רבנית
| שם = רבי דן אשכנזי
| שם בשפת המקור = 
| תמונה = 
| כיתוב = 
| כינוי = 
| תאריך לידה = 
| מקום לידה = 
| תאריך פטירה = 
| מקום פטירה = 
| סיבת המוות = 
| מקום קבורה =  
| תאריך לידה עברי = 
| תאריך פטירה עברי = 
| מקום פעילות = 
| השתייכות = רבני [[אשכנז]], רבני [[ספרד]], [[ראשונים]]
| תחומי עיסוק = הלכה, פרשנות המקרא 
| תפקידים נוספים = 
| רבותיו = [[מהר"ם מרוטנבורג]]
| תלמידיו = 
| בני דורו = 
| בן זוג = 
| בת זוג = 
| צאצאים = 
| חתימה = 
}}

רבי '''דן בן יוסף אשכנזי''' (את הכינוי אשכנזי קיבל ב[[ספרד]] בעקבות מוצאו) חי ופעל ב[[אשכנז]] במחצית השנייה של [[המאה ה-13]], ובהמשך היגר לספרד שם פעל עד לפטירתו.

על קורותיו ב[[אשכנז]] ידוע מעט מאוד מלבד העובדה שהשתייך לחוגו הפנימי של רבו [[מהר"ם מרוטנבורג]] והתערב בשאלות ציבוריות שונות.

עם עלייתו של המלך [[רודולף הראשון, מלך גרמניה|רודולף הראשון]] בשנת [[1286]] וההרעה שחלה בעקבות כך במצבם של יהודי אשכנז, עזב רבנו דן את אשכנז בסביבות שנת 1287/8 ועבר להתגורר בספרד בעיר [[סרגוסה]] ולאחר מכן הקים ישיבה ב[[טולדו]].

בספרד היה מעורב רבנו דן בפולמוסים הלכתיים חריפים כשבחלקם הביע דעה הלכתית עצמאית וחריגה מאוד (כגון הכשר שחיטת נכרי), מה שגרם לוויכוחים סוערים עם בני תקופתו ובמיוחד עם ה[[רשב"א]].{{הערה|במקור מפוקפק ([[שאול ברלין|שו"ת בשמים ראש]] סי' כד) מסופרת גם אגדה מוזרה על כך שרבנו דן כתב לעצמו תפילין בתרגום לארמית והניחן.}}

פרשה נוספת ששמו של רבנו דן נקשר בה היא זו של הנביא נסים בן אברהם מ[[אווילה]] שהסעירה את קהילות ספרד בשנת [[1295]] בערך, כאשר תוך כדי מאבקו של הרשב"א להוקעתו של הנביא כתב רבנו דן מכתב התומך בו ובנבואתו, דבר שהביך מאוד את הרשב"א שכתב על כך את הדברים הבאים:

{{ציטוט| תוכן=זה כששה חדשים עבר בכאן נער חסר לב, ובידו איגרת חתומה מיד הרב רבי דן, וכראותיה היה הדבר קשה בעיני, יען חשבו רבים את זה לקלות הדעת, כי מה שיצריך חקירה רבה, וכמעט לא יספיקו בו כל החקירות, יכתוב איש שנקרא חכם, כמעיד: 'זאת אמת'. ואין אלו דברי חכם ולא יאות כזה לנקיי הדעת רק לנמהרי הלב ולאשר לא תעשינה ידיהם תושיה.|מקור=תשובות הרשב"א חלק א סימן תקמח}}

למרות הוויכוחים הרבים שעברו בין הרשב"א לרבנו דן נשמר ביניהם יחס של כבוד הדדי והרשב"א אף כותב ש"כדאי הוא לסמוך עליו". וגם רבינו [[בחיי בן אשר]] שהיה תלמידו של הרשב"א מביא בשמו כמה פעמים בספרו "רבינו בחיי" על התורה.{{הערה|לפי הפירוש בפ' שמות ב, כא, שם כתב, "כך שמעתי מפי הרב רבי דן ז"ל". ובפ' משפטים כד, יא.}}

חוץ מעיסוקו ההלכתי, היה פעיל רבות גם בפרשנות המקרא ומלבד המובאות משמו בחיבורים שונים כתב כנראה גם פירוש שלם על התורה שאבד. פירושיו שנשתמרו מתאפיינים במקוריות, חדשנות ונועזות.

==לקריאה נוספת==
* [[ישראל מ' תא-שמע]], '''רבנו דן מגלות אשכנז אשר בספרד''', כנסת מחקרים - עיונים בספרות הרבנית בימי הביניים, כרך ב עמ' 149–166
== קישורים חיצוניים ==
* {{אוצר הגדולים|ג|145|עמודים=קמד-קמה}}, אות קצא

==הערות שוליים==
{{הערות שוליים|יישור=ימין}}
{{מיון רגיל: דן, בן יוסף
[[קטגוריה:רבנים: ראשונים]]
[[קטגוריה:ראשוני ספרד]]
[[קטגוריה:תלמידי המהר"ם מרוטנבורג]]
[[קטגוריה:רבנים משנות ה' אלפים - ה'ק']]
{{וח|דן בן יוסף אשכנזי}}
{{מיון ויקיפדיה|דף=דן בן יוסף אשכנזי|גרסה=34658851|פריט=Q6812206}}
`;
    it("should throw unclosed template error when parsing all the templates", () => {
      expect(() => getTemplates(articleText)).to.throw(
        errorMessages.unclosedTemplate
      );
    });
    it("should parse and find the right text when parsing the certain template before the curopted template", () => {
      const result = getTemplates(articleText, { name: "אישיות רבנית" });
      expect(result).to.deep.equal([
        {
          name: "אישיות רבנית",
          parameters: {
            שם: "רבי דן אשכנזי",
            "שם בשפת המקור": "",
            תמונה: "",
            כיתוב: "",
            כינוי: "",
            "תאריך לידה": "",
            "מקום לידה": "",
            "תאריך פטירה": "",
            "מקום פטירה": "",
            "סיבת המוות": "",
            "מקום קבורה": "",
            "תאריך לידה עברי": "",
            "תאריך פטירה עברי": "",
            "מקום פעילות": "",
            השתייכות: "רבני [[אשכנז]], רבני [[ספרד]], [[ראשונים]]",
            "תחומי עיסוק": "הלכה, פרשנות המקרא",
            "תפקידים נוספים": "",
            רבותיו: '[[מהר"ם מרוטנבורג]]',
            תלמידיו: "",
            "בני דורו": "",
            "בן זוג": "",
            "בת זוג": "",
            צאצאים: "",
            חתימה: "",
          },
          anonParameters: [],
          fullText: `{{אישיות רבנית
| שם = רבי דן אשכנזי
| שם בשפת המקור = 
| תמונה = 
| כיתוב = 
| כינוי = 
| תאריך לידה = 
| מקום לידה = 
| תאריך פטירה = 
| מקום פטירה = 
| סיבת המוות = 
| מקום קבורה =  
| תאריך לידה עברי = 
| תאריך פטירה עברי = 
| מקום פעילות = 
| השתייכות = רבני [[אשכנז]], רבני [[ספרד]], [[ראשונים]]
| תחומי עיסוק = הלכה, פרשנות המקרא 
| תפקידים נוספים = 
| רבותיו = [[מהר"ם מרוטנבורג]]
| תלמידיו = 
| בני דורו = 
| בן זוג = 
| בת זוג = 
| צאצאים = 
| חתימה = 
}}`,
        },
      ]);
    });
  });
  describe("handle nested templates when thay are asked", () => {
    const article = `{{מבנה
|סוג=[[מוזיאון ילדים]]
|כתובת=דוד הראובני 25, באר-שבע
|מייסדים=ג'ק, ג'וזף ומורטון מנדל
|מפה={{מממו|באר שבע}}
|כיתוב מפה=
|תאריך סיום=2015}}
'''לונדע''' הוא [[מוזיאון ילדים]] בשכונת [[נחל עשן]] שב[[באר שבע]], סמוך לבית הספר התיכון "טוביהו", במבנה גדול בו שכן בעבר סניף של "[[חווידע]]". המוזיאון נבנה בשנת [[2015]] ונקרא על שם ג'ק, ג'וזף ו[[מורטון מנדל]]. מטרתו לעודד בילוי משפחתי רב-גילאי על ידי למידה באמצעות משחק.

המוזיאון מיועד לילדים מגיל שנה וחצי עד גיל שתים עשרה, והוריהם. זהו המוזיאון הראשון בארץ, בו המתחמים הם רב-גילאיים ותוכננו במטרה לספק עניין משותף למשפחות שלמות יחד, על מנעד הגילאים הרחב של ילדיהן. המוזיאון עוסק בנושאים מחיי היומיום וכולל מתחמי למידה כגון מתחמים העובדים על [[מוטוריקה]] גסה, מתחמי רגשות, מתחמי אומנות וכו'. המוזיאון מתאפיין בכך שהכניסה אליו היא ללא נעליים, על מנת להשרות רוגע ותחושה ביתית על המבקרים בו. מפתיחת המקום ועד [[נובמבר]] [[2019]] הלונדע נוהל על ידי אלעד אזולאי, לשעבר מנהל מרכז מצוינות במנהיגות ומעורבות חברתית בבאר-שבע, וכמנהל החינוכי של עמותת "ידידים" לקידום [[נוער בסיכון]]. לאחר מכן, ניהול המוזיאון הועבר לידי אורטל מיכאל-חדד שמשמשת כמנהלת עד היום.

למרגלות ה"לונדע" מתוכנן [[פארק הילדים (באר שבע)|פארק הילדים]] המשתרע על 54 דונם.

בכניסה למוזיאון נמצא פסל ארוך המורכב מגלילים הקצרים בעוביים ומסודרים לפי צבעי הקשת.

== היסטוריית המבנה == 
המוזיאון נקרא על שם האחים ג'ק, ג'וזף ו[[מורטון מנדל]] אשר תרמו לעיריית באר שבע תרומה על סך חמישה מיליון דולר, לצורך הקמת המוזיאון. את המרכז ותכניו יזמה, יצרה ופיתחה חברת "Playpus" בראשותן של תמר הדר ואפרת אדיב, ועיצובו ותכנון המתקנים בו, נעשה על ידי יעַל טבת ורואי רוט, מחברת "רוט-טבת Experience Design". 

דבריו של מורטון ל. מנדל, יו"ר ונשיא קרן מנדל:
{{ציטוט|תוכן="... אנו מברכים את ההזדמנות לתמוך בעיר באר שבע בהקמת מוזיאון ייחודי לילדים אשר יתרום להעשרת המשפחות בעיר. קרן מנדל פועלת לחיזוק מדינת ישראל בתחומים שונים לרבות חינוך, חברה יזמות ותרבות, ורואה בתרומה זו המשך תמיכה בחינוך, באמצעות למידה ויצירה."}}

בחנוכת המוזיאון וביקורו של נשיא המדינה [[ראובן ריבלין]], נאמר: {{ציטוט|תוכן="אסור לנו, להפקיר את הזירה התרבותית ולהותיר אותה רק ב[[תל אביב]] [[חיפה]] ו[[ירושלים]]. אסור שהנגב יישאר מאחור. לאורך השנים, רבות מההחלטות שקבלה [[מדינת ישראל]] בנוגע לבאר שבע ולמרחב [[הנגב]], נותרו החלטות 'על הנייר'. בבחינת 'מס שפתים'. הגיע הזמן לעשות השקעה בנגב, היא משימה מאתגרת. המבחן איננו בהבטחה אלא בישום. עלינו להפך את הנגב לחלק מישראל אמתית. מישראל של מרכז הארץ ישראל שהיא קרובה אל העין, וגם קרובה אל הלב. אסור שהמרחק הפיזי ישפיע על שוויון ההזדמנויות של חלק נכבד מהחברה הישראלית, שקבע את מקום מושבו בנגב."}}{{הערה|[http://www.beershevacity.com/beershevacity-art/לונדע-נחנך-מוזיאון-הילדים-בבאר-שבע לונדע: נחנך מוזיאון הילדים בבאר שבע], אתר "באר שבע סיטי, 25 במרץ 2015}}

במוזיאון ישנן 3 קומות, על שטח כולל של 4,000 מ"ר המעוצב בצבעוניות שמזמינה את הילדים להתנסות בפעילויות השונות. בקומות נמצאים שמונה מתחמים שונים המחולקים לפי נושאים ויותר מ-50 פעילויות.

== בקומה האמצעית (קומת הכניסה) ==
=== רואים עולם === 
[[קובץ:Lunada Children Museum06.png|200px|ממוזער|שמאל|מתקן התאמת בעלי חיים במתחם רואים עולם]]
מתחם שבו הילד לומד להתמצא ב[[כדור הארץ]] וב[[חלל]]. התחנה כוללת [[מבוך]], [[מגדל פיקוח]], הכרת חיות העולם, הכרת [[מערכת השמש]] ו[[כח המשיכה]]. המתחם כולל פעילויות והדגמות כגון גלובוס שעליו יש להצמיד מגנטי בעלי חיים בהתאם למקום בו חי בעל החיים. [[קיר טיפוס]] המציג שמות של הרים ברחבי העולם וגובהם. קיר עם מפת העולם עם שמות מדינות וסימני ההיכר שלהן, מבוך בנושא החלל ובו סממנים זוהרים בצורות המאפיינות אסוציאות הקשורות לחלל, למשל, חייזרים, חלליות וכוכבים. בנוסף, המתחם מציג מידע על כוכבים שונים ברחבי הגלקסיה ומסכי טלוויזיות המציגים סרטוני [[בריינפופ]] בנושא החלל.

=== מתחמי "זזים" === 
מתחם העוסק בפעילות אקטיבית בצורה מיוחדת, ומטרתו לפתח מוטוריקה גסה. לדוגמה, פעילות הכוללת חדר חושך שעוברות בו קרני לייזרים כשהמשימה היא לעבור דרכן מבלי "להיפגע מהן" ומשחק [[קליעה למטרה]] עם תותחי כדורים ענקיים 
שניתן לשאוב באמצעות שואבי ענק או לזרוק למטרות המצוירות. בנוסף, קיים '''מתחם זזים קטנים''' לפעוטות, ובו פעילויות המתאימות לגיל הרך, כגון קרוסלות וקיר מגנטי, מסלולי ריצה וקלידים ענקיים שמופעלים על ידי הליכה עליהם.

== הקומה העליונה ==
=== מתחם אמנות ומוזיקה === 
בו הילד לומד אמנות ממוחשבת, צלילים מיוחדים, קיר אורות וצביעת פורטרטים. המתחם כולל קיר מיוחד, שניתן לצבוע עליו תמונות של ציורים מפורסמים בשחור ולבן, המשמשים כדפי צביעה ענקיים שניתן לצבוע על פי רצון באמצעות גירים וספוג מחיקה המחובר גם הוא לקיר. פעילות נוספת כוללת לוח שחור
בעל פתחים עגולים ומקלות סיליקון צבעוניים. כאשר מכניסים מקל צבעוני לאחד החורים נדלק [[אור]] הגורם למקל הצבעוני להאיר בצבע שלו וכך ניתן לשחק עם הצבעים המאירים וליצור דוגמאות וציורים שלמים. בנוסף, המתחם מכיל קיר גדול ועליו תמונות של כלי נגינה שונים, כאשר המשימה היא ללחוץ על הכפתורים וכך ליצור צלילים ושירים בהתאם לדפי ה[[תווים]] 
המונחים לצד הקיר.

=== מתחם שפות ===
במתחם ישנה עמדת שידור, הקראה ו[[צילום]] התהליך שבו הילד קורא קטעים מ[[מגילת העצמאות]], משולבת מילים בשפות שונות ומשחקי [[ארץ עיר]] ובהם תמונות של דברים שונים כגון חיות, בתים, מכוניות וחפצים ומתחתיהן כיתוב בשפה כלשהי :[[עברית]], [[רוסית]], [[אנגלית]], [[ערבית]], [[אמהרית]] ועוד.

=== מתחם רגשות וביטוי עצמי === 
במתחם מוצג באמצעים ויזואליים טווח הרגשות, באופן המסייע לילד להתמודד, להכיל ולהביע את עצמו אל מול הסביבה. במתחם נמצאות פעילויות הכוללות חדר ישיבה מיוחד ובו מסכים של סיטואציות שונות בטבע עליהם אמור להביע הילד את הרגשתו, מצלמות רגשות, המצלמות הבעות פנים של אנשים החווים רגש מסוים, וכדומה.

=== מתחם משאבים ===
[[קובץ:Lunada Children Museum17.jpg|200px|ממוזער|שמאל|מתקן במתחם משאבים]]
במתחם זה הילד לומד איך לנהל משאבי זמן, כסף ו[[תזונה]], בהיבטים האישיים, החברתיים והמשפחתיים: איך לנהל תקציב, איך בונים לוח זמנים וכו'. הפעילויות המוצגות במתחם כוללות משחקים שמלמדים כיצד לקנות נכון, כיצד לחסוך כסף, כיצד לנהל כסף וזמן, כיצד להרוויח כסף וכו'.

== בקומה התחתונה (הנמצאת מתחת לקומת הכניסה) ==
=== מתחם תיאטרון === 
[[קובץ:Lunada Children Museum11.png|250px|ממוזער|שמאל|הבמה במתחם התיאטרון]]
במתחם ישנה במה עם תאורה מתחלפת ושלל תלבושות, עמדת צילום התהליך של משחק הילד, בימוי והפקה של סצנות משחק שונות. המשתתפים יכולים לבחור תלבושות תפאורה וסיפור ולשחק כל דבר העולה בדעתם. ניתן לשחק קטע מתוך סדרות בערוץ "[[לוגי]]".הקטעים מוצגים על גבי מוניטור וברגע שמתחילים את ההצגה הקטע מצולם וניתן לראות אותו בסיום המשחק.

בנוסף, קיימים שני מתחמי חוץ הכוללים משחק [[סולמות ונחשים]] תלת ממדי.
המתחם כולל אזורי התארגנות ומזנון. לכל אורך המוזיאון בכל המתחמים והקומות והאזורים מפוזרים על גבי הקירות "בועות הידעת" עם עובדות מעניינות שונות על מבנה המוזיאון ועובדות הקשורות למתחם בו נמצאים.

== קישורים חיצוניים ==
{{ויקישיתוף בשורה|שם=Category:Lunada Children Museum|תצוגה=הלונדע}}
* {{אתר רשמי|http://lunada.co.il}}
* [https://www.facebook.com/7lunada עמוד הפייסבוק של לונדע] 
* [http://doula.co.il/355612 כתבה על המוזיאון] באתר "דולה"- פורטל למשפחה ולהורים שבדרך
* {{mynet|ליאור לרנר|למה הורה צריך לשלם על תינוק שנכנס למוזיאון?|4617029|12 במרץ 2015}}
* {{ynet|עינת שגיא אלפסה|בילוי לכל המשפחה: לונדע - מוזיאון הילדים של באר שבע|4619187|28 בינואר 2015}}
* [http://www.beershevacity.com/beer-sheva/לונדע-תרומה-של-5-מילין-דולר-תסייע-להקמת-מוזיאון-עולם-הילד-בבאר-שבע לונדע, תרומה של 5 מילין דולר תסייע להקמת מוזיאון עולם הילד בבאר שבע] באתר "באר שבע סיטי"
* [https://www.facebook.com/7lunada דף הפייסבוק של המוזיאון]
* [http://kinderland.xnet.co.il/arows%20presentation/c493/208624.php מידע על המוזיאון] באתר "קינדרלנד"
* [https://web.archive.org/web/20150525165730/http://www.local.co.il/beer-sheva/123170/article.htm כתבה על מינויו של אלעד אזולאי למנהל ה"לונדע"] באתר באר שבע לוקאל
* [http://www.beershevacity.com/beershevacity-art/לונדע-נחנך-מוזיאון-הילדים-בבאר-שבע לונדע : נחנך מוזיאון הילדים בבאר שבע] באתר "באר שבע סיטי"
* {{ynet|אילנה קוריאל|לונדע: מוזיאון הילדים החדש של הנגב|4640521|24 במרץ 2015}}
* [http://www.haaretz.co.il/CM.show_item_place,772,201,6575,.aspx מוזיאון לונדע באתר "עכבר העיר"]

==הערות שוליים==
{{הערות שוליים|יישור=ימין}}

[[קטגוריה:מוזיאוני ילדים]]
[[קטגוריה:באר שבע: מוזיאונים]]
[[קטגוריה:באר שבע: חינוך]]
{{וח}}
{{מיון ויקיפדיה|דף=לונדע|גרסה=28965358}}
`;
    it("should parse one nested templates correctly", () => {
      const result = getTemplates(article, { name: "מממו", nested: true });
      expect(result).to.deep.equal([
        {
          name: "מממו",
          parameters: {},
          anonParameters: ["באר שבע"],
          fullText: "{{מממו|באר שבע}}",
          nested: [],
        },
      ]);
    });
    it("should return multiple of the same template when asked", () => {
      const result = getTemplates(article, {
        name: "ynet",
        multi: true,
        nested: true,
      });
      expect(result).to.deep.equal([
        {
          name: "ynet",
          parameters: {},
          anonParameters: [
            "עינת שגיא אלפסה",
            "בילוי לכל המשפחה: לונדע - מוזיאון הילדים של באר שבע",
            "4619187",
            "28 בינואר 2015",
          ],
          fullText:
            "{{ynet|עינת שגיא אלפסה|בילוי לכל המשפחה: לונדע - מוזיאון הילדים של באר שבע|4619187|28 בינואר 2015}}",
          nested: [],
        },
        {
          name: "ynet",
          parameters: {},
          anonParameters: [
            "אילנה קוריאל",
            "לונדע: מוזיאון הילדים החדש של הנגב",
            "4640521",
            "24 במרץ 2015",
          ],
          fullText:
            "{{ynet|אילנה קוריאל|לונדע: מוזיאון הילדים החדש של הנגב|4640521|24 במרץ 2015}}",
          nested: [],
        },
      ]);
    });
  });
  describe("handle multiple named templates correctly", () => {
    it("should return multiple templates with the same name", () => {
      const wikitext = `
    {{Template1|param1=value1}}
    Some text in between.
    {{Template1|param1=value2|param2=value3}}
  `;
      const result = getTemplates(wikitext, {
        name: "Template1",
        multi: true,
        nested: true,
      });

      expect(result).to.deep.equal([
        {
          name: "Template1",
          parameters: {
            param1: "value1",
          },
          anonParameters: [],
          nested: [],
          fullText: "{{Template1|param1=value1}}",
        },
        {
          name: "Template1",
          parameters: {
            param1: "value2",
            param2: "value3",
          },
          nested: [],
          anonParameters: [],
          fullText: "{{Template1|param1=value2|param2=value3}}",
        },
      ]);
    });
    it("should return multiple templates with the same name also when nested", () => {
      const wikitext = `
    {{Template1|param1=value1|nested={{Template2|param2=value2}}}}
    Some text in between.
    {{Template1|param1=value2|param2=value3|nested={{Template2|param3=value3}}}}
    `;
      const result = getTemplates(wikitext, {
        name: "Template2",
        multi: true,
        nested: true,
      });
      expect(result).to.deep.equal([
        {
          name: "Template2",
          parameters: {
            param2: "value2",
          },
          anonParameters: [],
          fullText: "{{Template2|param2=value2}}",
          nested: [],
        },
        {
          name: "Template2",
          parameters: {
            param3: "value3",
          },
          anonParameters: [],
          fullText: "{{Template2|param3=value3}}",
          nested: [],
        },
      ]);
    });
    it("should return multiple templates with the same name and nested", () => {
      const text = `{{מנהיג
| שם = ג'ון גורטון
| תמונה = [[קובץ:JohnGorton.jpg|250px|מרכז|גורטון, 1967]]
| כיתוב = גורטון בתמונה משנת 1967
| שם בשפת המקור = John Gorton
| שם מלא = ג'ון גריי גורטון
| מדינה = {{דגל|אוסטרליה||+}}
| מקום קבורה =
| תאריך לידה = [[9 בספטמבר]] [[1911]]
| מקום לידה = [[מלבורן]], [[ויקטוריה (אוסטרליה)|ויקטוריה]], [[אוסטרליה]]
| תאריך פטירה = [[19 במאי]] [[2002]]
| מקום פטירה = [[סידני]], [[ניו סאות' ויילס]]
| מפלגה = [[המפלגה הליברלית של אוסטרליה|המפלגה הליברלית]]
| בת זוג = בטינה גורטון (1983-1935) {{ש}} ננסי הורן (2002-1993)
| בן זוג =
| אתר אינטרנט =
| תפקיד1 = {{תפקיד מנהיג
| שם התפקיד = [[ראש ממשלת אוסטרליה]]
| למניין = 19
| התחלת כהונה = [[10 בינואר]] [[1968]]
| סיום כהונה = [[10 במרץ]] [[1971]]
| הקודם בתפקיד = [[ג'ון מק'איוון]]
| הבא בתפקיד = [[ויליאם מקמהון]]
}}
| תפקיד2 = {{תפקיד מנהיג
 |שם התפקיד=שירות צבאי
}}
{{אישיות ביטחונית
| סיווג = חייל
| שם = -
| תמונה = -
| השתייכות = [[קובץ:Air Force Ensign of Australia.svg|22px]] [[חיל האוויר המלכותי האוסטרלי]]
| התחלת פעילות = 1944 
| סיום פעילות = 1940
| דרגה = [[קובץ:RAAF O3 rank.png|18px]] לוטננט טיסה
| תפקידים בשירות = טייס קרב
| פעולות ומבצעים = [[מלחמת העולם השנייה]]
}}
}}`;
      const result = getTemplates(text, {
        name: "תפקיד מנהיג",
        multi: true,
        nested: true,
      });
      expect(result).to.deep.equal([
        {
          name: "תפקיד מנהיג",
          parameters: {
            "שם התפקיד": "[[ראש ממשלת אוסטרליה]]",
            למניין: "19",
            "התחלת כהונה": "[[10 בינואר]] [[1968]]",
            "סיום כהונה": "[[10 במרץ]] [[1971]]",
            "הקודם בתפקיד": "[[ג'ון מק'איוון]]",
            "הבא בתפקיד": "[[ויליאם מקמהון]]",
          },
          anonParameters: [],
          fullText: `{{תפקיד מנהיג
| שם התפקיד = [[ראש ממשלת אוסטרליה]]
| למניין = 19
| התחלת כהונה = [[10 בינואר]] [[1968]]
| סיום כהונה = [[10 במרץ]] [[1971]]
| הקודם בתפקיד = [[ג'ון מק'איוון]]
| הבא בתפקיד = [[ויליאם מקמהון]]
}}`,
          nested: [],
        },
        {
          name: "תפקיד מנהיג",
          parameters: {
            "שם התפקיד": "שירות צבאי",
          },
          anonParameters: [],
          fullText: `{{תפקיד מנהיג
 |שם התפקיד=שירות צבאי
}}`,
          nested: [],
        },
      ]);
    });
  });
});
